In [2]:
import numpy as np
import pandas as pd

In [4]:
dataset = pd.read_csv("https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv")

In [5]:
dataset.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [6]:
dataset.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,60.309792,GSW,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,68.013329,CLE,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

In [7]:
dataset = pd.read_csv("nbaallelo.csv")

In [8]:
dataset.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [10]:
dataset["gameorder"]

0             1
1             1
2             2
3             2
4             3
          ...
126309    63155
126310    63156
126311    63156
126312    63157
126313    63157
Name: gameorder, Length: 126314, dtype: int64

In [13]:
dataset[ ["seasongame", "is_playoffs"] ][:5]

   seasongame  is_playoffs
0           1            0
1           1            0
2           1            0
3           2            0
4           1            0

In [12]:
dataset.iloc[0] #baca baris ke berapa

gameorder                   1
game_id          194611010TRH
lg_id                     NBA
_iscopy                     0
year_id                  1947
date_game           11/1/1946
seasongame                  1
is_playoffs                 0
team_id                   TRH
fran_id               Huskies
pts                        66
elo_i                    1300
elo_n                 1293.28
win_equiv             40.2948
opp_id                    NYK
opp_fran               Knicks
opp_pts                    68
opp_elo_i                1300
opp_elo_n             1306.72
game_location               H
game_result                 L
forecast             0.640065
notes                     NaN
Name: 0, dtype: object

In [20]:
dataset.iloc[[99,100,101]]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
99,50,194611250PIT,NBA,0,1947,11/25/1946,10,0,PIT,Ironmen,...,37.327347,NYK,Knicks,62,1309.9252,1327.9469,H,L,0.603523,NaN
100,51,194611260DTF,NBA,0,1947,11/26/1946,11,0,DTF,Falcons,...,42.861538,CLR,Rebels,46,1311.4692,1300.3143,H,W,0.633588,NaN
101,51,194611260DTF,NBA,1,1947,11/26/1946,8,0,CLR,Rebels,...,41.032970,DTF,Falcons,66,1306.6039,1317.7588,A,L,0.366412,NaN

Series

In [22]:
type(dataset["gameorder"])

pandas.core.series.Series

In [26]:
daerah = pd.Series(["jakarta", "bandung", "bali"])
daerah

0    jakarta
1    bandung
2       bali
dtype: object

In [28]:
angka = pd.Series(["8, 9, 10"])
angka

0    8, 9, 10
dtype: object

In [32]:
angka = pd.Series([8, 9, 10])
angka

0     8
1     9
2    10
dtype: int64

In [33]:
a = {"a": 3, "b": 8, "c": 90}
dengan_indeks = pd.Series(a)
dengan_indeks

a     3
b     8
c    90
dtype: int64

In [34]:
dengan_indeks.iloc[1] # baris kedua

8

In [35]:
dengan_indeks.loc["b"] # baris indeks

8

In [36]:
dataset.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [37]:
dataset.loc["2"]

KeyError: '2'

In [38]:
angka = pd.Series([8, 9, 10])
angka

0     8
1     9
2    10
dtype: int64

In [43]:
genap = pd.Series([1,20])
genap

0     1
1    20
dtype: int64

In [46]:
genap = np.arange(0,20,2)
deret_genap = pd.Series(genap)
deret_genap

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int32

In [48]:
data_untuk_dengan_indeks = {"a":3, "b":8, "c":10}
dengan_indeks = pd.Series(data_untuk_dengan_indeks, ["b", "c"], dtype=np.int32)
dengan_indeks

b     8
c    10
dtype: int32

In [49]:
deret_genap.sum()

90

In [50]:
deret_genap.count()

10

In [51]:
deret_genap.cumsum()

0     0
1     2
2     6
3    12
4    20
5    30
6    42
7    56
8    72
9    90
dtype: int32

In [52]:
deret_genap.explode()

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int32

In [53]:
kota_ds = pd.DataFrame({
    "kota": ["jakarta", "bandung", "semarang"],
    "populasi" : pd.Series([9, 2, 1])
})
kota_ds

       kota  populasi
0   jakarta         9
1   bandung         2
2  semarang         1

In [61]:
kota_ds = pd.DataFrame({
    
    "kota": ["jakarta", "bandung", "semarang"],
    "populasi" : pd.Series(([9, 2, 1]),
                index = ["a", "b", "c"])
    
})
kota_ds

       kota  populasi
a   jakarta         9
b   bandung         2
c  semarang         1

In [62]:
kota_ds["populasi"].sum()

12

In [63]:
kota_ds.iloc[1]

kota        bandung
populasi          2
Name: b, dtype: object

In [64]:
kota_ds[ kota_ds["populasi"]<9]

       kota  populasi
b   bandung         2
c  semarang         1

In [65]:
kota_ds["walikota"] = pd.Series(["Budi", "Susi", "Joko"], index=["a", "b", "c"])

In [66]:
kota_ds

       kota  populasi walikota
a   jakarta         9     Budi
b   bandung         2     Susi
c  semarang         1     Joko

In [67]:
kota_ds.append({"kota": "manado", "populasi": 5, "walikota": "Nila"}, ignore_index = True)

       kota  populasi walikota
0   jakarta         9     Budi
1   bandung         2     Susi
2  semarang         1     Joko
3    manado         5     Nila

In [68]:
kota_ds

       kota  populasi walikota
a   jakarta         9     Budi
b   bandung         2     Susi
c  semarang         1     Joko

In [74]:
kota_ds.axes[1]

Index(['kota', 'populasi', 'walikota'], dtype='object')

In [91]:
baris_manado = pd.Series({"kota": "manado", "populasi": 5, "walikota": "Nila"}, name="d")
baris_manado

kota        manado
populasi         5
walikota      Nila
Name: d, dtype: object

In [92]:
kota_ds.append(baris_manado)

       kota  populasi walikota
a   jakarta         9     Budi
b   bandung         2     Susi
c  semarang         1     Joko
d    manado         5     Nila

In [95]:
baris_surabaya = pd.Series({"kota": "surabaya", "populasi": 21, "walikota": "Baya"}, name="e")
baris_surabaya

kota        surabaya
populasi          21
walikota        Baya
Name: e, dtype: object

In [96]:
kota_ds.append(baris_surabaya)

       kota  populasi walikota
a   jakarta         9     Budi
b   bandung         2     Susi
c  semarang         1     Joko
d    manado         5     Nila
e  surabaya        21     Baya

In [93]:
kota_ds = kota_ds.append(baris_manado)

In [94]:
kota_ds

       kota  populasi walikota
a   jakarta         9     Budi
b   bandung         2     Susi
c  semarang         1     Joko
d    manado         5     Nila

In [97]:
kota_ds = kota_ds.append(baris_surabaya)

In [98]:
kota_ds

       kota  populasi walikota
a   jakarta         9     Budi
b   bandung         2     Susi
c  semarang         1     Joko
d    manado         5     Nila
e  surabaya        21     Baya

In [99]:
c = pd.DataFrame({
    "a": [1,3,4],
    "b": [4,4,4],
    "c": [8,2,1]
    
})
c

   a  b  c
0  1  4  8
1  3  4  2
2  4  4  1

In [100]:
c.sum()

a     8
b    12
c    11
dtype: int64

In [101]:
c.sum(axis=1)

0    13
1     9
2     9
dtype: int64

In [107]:
c.loc[1:3, ["a","b"]]

   a  b
1  3  4
2  4  4

###

In [108]:
kota_ds

       kota  populasi walikota
a   jakarta         9     Budi
b   bandung         2     Susi
c  semarang         1     Joko
d    manado         5     Nila
e  surabaya        21     Baya

In [127]:
kota_ds.loc["c" ,"walikota"]

'Joko'

In [128]:
kota_ds.loc["d" ,"populasi"]

5

In [129]:
kota_ds[kota_ds["kota"]== "semarang"]["walikota"]

c    Joko
Name: walikota, dtype: object

In [130]:
kota_ds[kota_ds["kota"]== "manado"]["populasi"]

d    5
Name: populasi, dtype: int64

In [134]:
kota_ds[ (kota_ds["walikota"] == "Nila") & (kota_ds["populasi"]<9)] ["populasi"]

d    5
Name: populasi, dtype: int64

In [135]:
kota_ds["jenis_kelamin"] = pd.Series(["L", "P", "L", "P", "L"], ["a", "b", "c", "d", "e"])

In [136]:
kota_ds

       kota  populasi walikota jenis_kelamin
a   jakarta         9     Budi             L
b   bandung         2     Susi             P
c  semarang         1     Joko             L
d    manado         5     Nila             P
e  surabaya        21     Baya             L

In [138]:
kota_ds.groupby(["jenis_kelamin"])["populasi"] .sum()

jenis_kelamin
L    31
P     7
Name: populasi, dtype: int64

In [140]:
kota_ds[ kota_ds["kota"] != "manado"]

       kota  populasi walikota jenis_kelamin
a   jakarta         9     Budi             L
b   bandung         2     Susi             P
c  semarang         1     Joko             L
e  surabaya        21     Baya             L

In [141]:
kota_ds[ kota_ds["kota"] != "manado"].groupby(["jenis_kelamin"])["populasi"] .sum()

jenis_kelamin
L    31
P     2
Name: populasi, dtype: int64

In [142]:
kota_ds

       kota  populasi walikota jenis_kelamin
a   jakarta         9     Budi             L
b   bandung         2     Susi             P
c  semarang         1     Joko             L
d    manado         5     Nila             P
e  surabaya        21     Baya             L

In [144]:
# jumlah walikota laki - laki dan perempuan di luar manado
kota_ds[ kota_ds["kota"] != "manado"].groupby(["jenis_kelamin"])["populasi"] .count()

jenis_kelamin
L    3
P    1
Name: populasi, dtype: int64

In [145]:
kota_ds.shape

(5, 4)

In [146]:
kota_ds.ndim

2

In [147]:
kota_ds["suhu"] = pd.Series([31, None, None, 35, 36], ["a","b","c","d","e"])

In [148]:
kota_ds

       kota  populasi walikota jenis_kelamin  suhu
a   jakarta         9     Budi             L  31.0
b   bandung         2     Susi             P   NaN
c  semarang         1     Joko             L   NaN
d    manado         5     Nila             P  35.0
e  surabaya        21     Baya             L  36.0

In [149]:
kota_ds.dropna()

       kota  populasi walikota jenis_kelamin  suhu
a   jakarta         9     Budi             L  31.0
d    manado         5     Nila             P  35.0
e  surabaya        21     Baya             L  36.0

In [152]:
kota_ds.fillna(kota_ds["suhu"].mean())

       kota  populasi walikota jenis_kelamin  suhu
a   jakarta         9     Budi             L  31.0
b   bandung         2     Susi             P  34.0
c  semarang         1     Joko             L  34.0
d    manado         5     Nila             P  35.0
e  surabaya        21     Baya             L  36.0

In [151]:
kota_ds.fillna(kota_ds["suhu"].count())

       kota  populasi walikota jenis_kelamin  suhu
a   jakarta         9     Budi             L  31.0
b   bandung         2     Susi             P   3.0
c  semarang         1     Joko             L   3.0
d    manado         5     Nila             P  35.0
e  surabaya        21     Baya             L  36.0

In [154]:
kota_ds.groupby(["suhu"])["populasi"].count()

suhu
31.0    1
35.0    1
36.0    1
Name: populasi, dtype: int64

In [155]:
kota_ds = kota_ds.fillna(kota_ds["suhu"].mean())

In [156]:
kota_ds

       kota  populasi walikota jenis_kelamin  suhu
a   jakarta         9     Budi             L  31.0
b   bandung         2     Susi             P  34.0
c  semarang         1     Joko             L  34.0
d    manado         5     Nila             P  35.0
e  surabaya        21     Baya             L  36.0

In [160]:
kota_ds.groupby(["suhu"])["kota"].count()

suhu
31.0    1
34.0    2
35.0    1
36.0    1
Name: kota, dtype: int64

In [162]:
kota_ds.describe()

       populasi       suhu
count   5.00000   5.000000
mean    7.60000  34.000000
std     8.11172   1.870829
min     1.00000  31.000000
25%     2.00000  34.000000
50%     5.00000  34.000000
75%     9.00000  35.000000
max    21.00000  36.000000